Nama : Credenda Mirandantons

In [1]:
import pandas as pd

# Soal Beginner

## No.1

In [2]:
# Question : Buatlah python syntax untuk membuat data frame

data = pd.DataFrame({'No'         : [1, 2, 3, 4, 5],
                     'nama_siswa' : ['Adi', 'Budi', 'Carli', 'Dadan', 'Endang'],
                     'umur'       : [15, 16, 14, None ,16],
                     'email'      : ['andi@gmail.com', 'budi@gmail.com', 'carli@rakamin.com', 'dadan@rakamin.com', 'endang@gmail.com'],
                     'score_matematika' : [80, 90, 100, 95, 97],
                     'score_ekonomi'    : [90, 95, 100, 86, None],
                     'score_olahraga'   : [97, 95, 96, 100, 94]})
data

,No,nama_siswa,umur,email,score_matematika,score_ekonomi,score_olahraga
0,1,Adi,15.0,andi@gmail.com,80,90.0,97
1,2,Budi,16.0,budi@gmail.com,90,95.0,95
2,3,Carli,14.0,carli@rakamin.com,100,100.0,96
3,4,Dadan,NaN,dadan@rakamin.com,95,86.0,100
4,5,Endang,16.0,endang@gmail.com,97,NaN,94

## No.2

In [3]:
# Point 1 : Urutkan data frame berdasarkan kolom score_matematika dari nilai 
#           terbesar hingga nilai terkecil.


data_sorted = data.sort_values('score_matematika', ascending = False)
data_sorted

,No,nama_siswa,umur,email,score_matematika,score_ekonomi,score_olahraga
2,3,Carli,14.0,carli@rakamin.com,100,100.0,96
4,5,Endang,16.0,endang@gmail.com,97,NaN,94
3,4,Dadan,NaN,dadan@rakamin.com,95,86.0,100
1,2,Budi,16.0,budi@gmail.com,90,95.0,95
0,1,Adi,15.0,andi@gmail.com,80,90.0,97

In [4]:
# Point 2 : Dari “data_sorted” tersebut, ambil baris pada siswa dengan 
#           score_matematika terkecil

data_lowest_score = data_sorted[data_sorted['score_matematika'] 
                    == data_sorted['score_matematika'].min()]
data_lowest_score

,No,nama_siswa,umur,email,score_matematika,score_ekonomi,score_olahraga
0,1,Adi,15.0,andi@gmail.com,80,90.0,97

In [5]:
# Point 3 : siapa nama siswa dengan score_matematika terkecil?

data_lowest_score[['nama_siswa']]

  nama_siswa
0        Adi

## No.3

In [6]:
# Point 1 : Filter siswa yang memiliki email ber-domain gmail DAN memiliki 
#           score_ekomomi tidak null

data_siswa_gmail = data[data['email'].str.contains('@gmail.com') 
                      & data['score_ekonomi'].notnull()]
data_siswa_gmail

,No,nama_siswa,umur,email,score_matematika,score_ekonomi,score_olahraga
0,1,Adi,15.0,andi@gmail.com,80,90.0,97
1,2,Budi,16.0,budi@gmail.com,90,95.0,95

In [7]:
# Point 2 : Berapa umur rata-rata dari siswa di “data_siswa_gmail” tersebut?

data_siswa_gmail['umur'].mean()

15.5

## No.4

In [8]:
# Point 1 : Buatlah data frame berikut, dan simpan dengan nama “additional_data”

additional_data = pd.DataFrame({'No'         : [6, 7], 
                                'nama_siswa' : ['Fauzan', 'Guntur'],
                                'umur'       : [15, 16],
                                'email'      : ['fauzan@gmail.com', 'guntur@gmail.com'],
                                'score_matematika' : [80, 90],
                                'score_ekonomi'    : [90, 95],
                                'score_olahraga'   : [97, 95]})
additional_data

,No,nama_siswa,umur,email,score_matematika,score_ekonomi,score_olahraga
0,6,Fauzan,15,fauzan@gmail.com,80,90,97
1,7,Guntur,16,guntur@gmail.com,90,95,95

In [9]:
# Point 2 : Kemudian append “additional_data” tersebut dengan data frame 
#           “data” pada no.1 di atas.

new_data = data.append(additional_data, ignore_index = False)
new_data

,No,nama_siswa,umur,email,score_matematika,score_ekonomi,score_olahraga
0,1,Adi,15.0,andi@gmail.com,80,90.0,97
1,2,Budi,16.0,budi@gmail.com,90,95.0,95
2,3,Carli,14.0,carli@rakamin.com,100,100.0,96
3,4,Dadan,NaN,dadan@rakamin.com,95,86.0,100
4,5,Endang,16.0,endang@gmail.com,97,NaN,94
0,6,Fauzan,15.0,fauzan@gmail.com,80,90.0,97
1,7,Guntur,16.0,guntur@gmail.com,90,95.0,95

In [10]:
# Point 3 : berapa median umur mereka sekarang? (setelah append dilakukan)

new_data['umur'].median()

15.5

## No.5

In [11]:
# Point 1 : Buatlah data frame berikut, dan simpan dengan nama “data_address” 

data_address = pd.DataFrame({'nama' : ['Adi', 'Budi', 'Dadan', 'Endang', 'Guntur', 'Halim'],
                             'alamat' : ['DKI Jakarta', 'DKI Jakarta', 'Banten', 'Banten', 'Jawa Barat', 'Aceh']})
data_address

     nama       alamat
0     Adi  DKI Jakarta
1    Budi  DKI Jakarta
2   Dadan       Banten
3  Endang       Banten
4  Guntur   Jawa Barat
5   Halim         Aceh

In [12]:
# Point 2 : Lakukanlah merge data frame “new_data” pada no.4 di atas 
#           dengan “data_address”

new_merge = new_data.merge(data_address,
                           left_on = 'nama_siswa',
                           right_on = 'nama',
                           how = 'inner'
                          )
new_merge

,No,nama_siswa,umur,email,score_matematika,score_ekonomi,score_olahraga,nama,alamat
0,1,Adi,15.0,andi@gmail.com,80,90.0,97,Adi,DKI Jakarta
1,2,Budi,16.0,budi@gmail.com,90,95.0,95,Budi,DKI Jakarta
2,4,Dadan,NaN,dadan@rakamin.com,95,86.0,100,Dadan,Banten
3,5,Endang,16.0,endang@gmail.com,97,NaN,94,Endang,Banten
4,7,Guntur,16.0,guntur@gmail.com,90,95.0,95,Guntur,Jawa Barat

In [13]:
# Point 3 : Bandingkan umur rata-rata siswa per alamat mereka berasal

agg_umur = new_merge.groupby('alamat').agg({'umur' : 'mean'})
agg_umur

             umur
alamat
Banten       16.0
DKI Jakarta  15.5
Jawa Barat   16.0

In [14]:
# Point 4 : Pada alamat yang mana, umur rata-rata mereka yang paling kecil?

agg_umur[agg_umur['umur'] == agg_umur['umur'].min()]

             umur
alamat
DKI Jakarta  15.5

# Soal Intermediate

## No.6

In [15]:
# read data

airlines = pd.read_excel(r'C:\Users\1234\Downloads\RakaminAcademy\HomeWork\Dataset\data_airlines.xlsx')
airports = pd.read_excel(r'C:\Users\1234\Downloads\RakaminAcademy\HomeWork\Dataset\data_airports.xlsx')
flights  = pd.read_excel(r'C:\Users\1234\Downloads\RakaminAcademy\HomeWork\Dataset\data_flights.xlsx')

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\1234\\Downloads\\RakaminAcademy\\HomeWork\\Dataset\\data_airlines.xlsx'

In [ ]:
# Point 1 : Total penerbangan per bulan selama 2015 (3 point)

flights[(flights['YEAR'] == 2015)].groupby('MONTH').agg({'DEPARTURE_TIME' : 'count'})

In [ ]:
# Point 2 : Total penerbangan yang CANCELLED per bulan

flights[(flights['YEAR'] == 2015) & (flights['CANCELLED'] == 1)].groupby('MONTH').agg({'CANCELLED' : 'count'})

In [ ]:
# Point 3 : Rata-rata, Minimum dan Maksimum ELAPSED_TIME per bulan

flights[(flights['YEAR'] == 2015)].groupby('MONTH').agg({'ELAPSED_TIME' : ['mean', 'min', 'max']})

## No.7

In [ ]:
# Question : Destinasi airport** mana yang paling 
#            banyak jumlah penerbangannya? 

airport_merge = pd.merge(airports, flights,
                         how='inner',
                         left_on = 'IATA_CODE',
                         right_on = 'DESTINATION_AIRPORT')

# filter airport Northwest Florida & John F. Kennedy
filter_airport = airport_merge[airport_merge['AIRPORT'].str.contains('^Northwest Florida|^John F. Kennedy')]

# total airport Northwest Florida & John F. Kennedy berdasarkan DESTINATION_AIRPORT
total_airport = filter_airport.groupby('AIRPORT').agg({'DESTINATION_AIRPORT' : 'count'})
total = total_airport.reset_index()

#total terbanyak
total_terbanyak = total[total['DESTINATION_AIRPORT'] == total['DESTINATION_AIRPORT'].max()]
total_terbanyak

# Soal Advanced

## No.8

In [ ]:
# read data

telecom_revenue = pd.read_csv('01 telecom_revenue.csv')
telecom_usage = pd.read_csv('02 telecom_usage.csv')

In [ ]:
# Point 1 : df_1:Filter dataset 01 telecom_revenue.csv dengan multiple kondisi

df_1 = telecom_revenue[(telecom_revenue['MonthlyRevenue'] > 10)
                        & (telecom_revenue['Occupation'].isin(['Professional', 'Student', 'Crafts']))]

df_1.head()

In [ ]:
# Point 2 : df_2:Filter dataset 02 telecom_usage.csv dengan multiple kondisi 

df_2 = telecom_usage[(telecom_usage['CustomerCareCalls'].
                      astype('str').str.contains('^2|^4|^6|^8'))
                      & (telecom_usage['UnansweredCalls'] > telecom_usage['BlockedCalls'])]
df_2.head()

In [ ]:
# Point 3 : Hitunglah total CustomerID** dan rata-rata DroppedCalls** untuk
#          masing-masing occupation

#merge
df_merge = df_1.merge(df_2, on = 'CustomerID')
df_merge.head(2)

#menghitung
df_occupation = df_merge.groupby('Occupation').agg({'CustomerID'   : ['count'], 'DroppedCalls' : ['mean']})
df_occupation

In [ ]:
# Point 4 : Pada occupation apa, rata-rata DroppedCalls paling besar? 

df_occupation.reset_index()
df_occupation['DroppedCalls'].max()